src/Documents/ОприходованиеТоваров/ОприходованиеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
	<name>ОприходованиеТоваров</name>
	<basedOn>Document.ИнвентаризацияТоваров</basedOn>
	<registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
	<attributes>
		<name>Склад</name>
		<type>
			<types>CatalogRef.Склады</types>
		</type>
	</attributes>
	<attributes>
		<name>Комментарий</name>
		<type>
			<types>String</types>
		</type>
	</attributes>
	<attributes>
		<name>Ответственный</name>
		<type>
			<types>CatalogRef.Пользователи</types>
		</type>
	</attributes>
	<attributes>
		<name>ВидОперации</name>
		<type>
			<types>EnumRef.ВидыОперацийПриход</types>
		</type>
	</attributes>
	<tabularSections>
		<name>Товары</name>
		<attributes>
			<name>Номенклатура</name>
			<type>
				<types>CatalogRef.Номенклатура</types>
			</type>
		</attributes>
		<attributes>
			<name>ЕдИзм</name>
			<type>
				<types>CatalogRef.ЕдиницыИзмерения</types>
			</type>
		</attributes>
		<attributes>
			<name>Количество</name>
			<type>
				<types>Number</types>
				<numberQualifiers>
					<precision>10</precision>
					<scale>2</scale>
				</numberQualifiers>
			</type>
		</attributes>
	</tabularSections>
</mdclass:Document>

src/Documents/ОприходованиеТоваров/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти 			= Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти.ЕдИзм		= РаботаСоСправочниками.УстановкаЕдИзм(СтрокаТабличнойЧасти.Номенклатура);
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	 
	 Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
	      Объект.Склад = Справочники.Склады.Основной;
	      Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	 КонецЕсли;	  
		  
КонецПроцедуры
 
 // отрабатываем подбор
&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыФормы = Новый Структура ("ЗакрыватьПриВыборе", Истина);
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы, Элементы.Товары);
	
 КонецПроцедуры
           // отрабатываем подбор
&НаКлиенте
Процедура ТоварыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Сч = проверкаНаличия(ВыбранноеЗначение);
	 
	Если Сч = 0 Тогда
		Элементы.Товары.ДобавитьСтроку();
		Элементы.Товары.ТекущиеДанные.Номенклатура = ВыбранноеЗначение;
		ЗаполнитьДанные(Элементы.Товары.ТекущиеДанные.Номенклатура, Элементы.Товары.ТекущиеДанные.НомерСтроки);
	КонецЕсли;
	
КонецПроцедуры

// отрабатываем подбор

&НаСервере
Функция проверкаНаличия(ВыбранноеЗначение)	
	
	Сч = 0;
	Для каждого Строч Из Объект.Товары Цикл
		 Если Строч.Номенклатура 	= ВыбранноеЗначение тогда
			 Строч.Количество 		= Строч.Количество + 1;// Если товар уже есть - то просто приплюсуем его;
	
			 Сч = 1;
		 КонецЕсли;
	КонецЦикла;
 
	Возврат Сч;
	 
КонецФункции	

// отрабатываем подбор
&НаСервере
Процедура ЗаполнитьДанные(товар, строка)
	
	Для каждого строч из Объект.Товары Цикл
		Если Строч.НомерСтроки = Строка Тогда
			
			Строч.ЕдИзм				= Товар.ЕдИзм;
			Строч.Количество		= 1;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
